var mamulList = {
	A: [],
	S: [],	
	E: []
};

var mamulZone = {
	"못생긴 보가쟈": "중부라노",
	"웅크테히": "저지라노",
	"마도 지옥손아귀": "동부라노",
	"난": "서부라노",
	"마베리": "고지라노",
	"콘누": "외지라노",
	"포르네우스": "중부삼림",
	"녹아내리는 젤리": "동부삼림",
	"게데": "남부삼림",
	"기르타브": "북부삼림",
	"알렉트리온": "서부다날",
	"사보텐더 무희": "중부다날",
	"마헤스": "동부다날",
	"자니고": "남부다날",
	"마지막 투혼": "북부다날",
	"쿠레아": "모르도나",
	"머라쿠": "커르중앙",
	"류바": "커르서부",
	"미르카": "커르서부",
	"시시우틀": "아발구름",
	"엔켈라도스": "아발구름",	
	"악취화": "아지스라",
	"캠파크티": "아지스라",
	"스톨라스": "저지드라",
	"기계병정 슬립킨크스": "저지드라",
	"와이번 로드": "고지드라",
	"파일라스터": "고지드라",
	"부네": "드라구름",
	"아가토스": "드라구름",
	
	"크로크 미테느": "중부라노",
	"개굴개로스": "저지라노",
	"갈록": "동부라노",
	"보나콘": "서부라노",
	"난디": "고지라노",
	"체르노보그": "외지라노",
	"레드로네트": "중부삼림",
	"울가루": "동부삼림",
	"정신지배자": "남부삼림",
	"천갈래덩굴 세다": "북부삼림",
	"조나 시커": "서부다날",
	"브론테스": "중부다날",
	"발라우르": "동부다날",
	"느뉴느위": "남부다날",
	"미뇨카온": "북부다날",
	"아그리파": "모르도나",
	"사파트": "커르중앙",
	"카이저 베히모스": "커르서부",
	"극락조": "아발구름",
	"레우크로타": "아지스라",
	"창백의 기수": "저지드라",
	"센무르": "고지드라",
	"간다르바": "드라구름"
};

var engZone = {
	""
}

function renderList() {
	var $table = $("#contents table tbody").empty();
	
	for (var i = 0; i < mamulList.A.length; i++) {
		var mamul = mamulList.A[i];
		var $row = $(".rowTemplate").clone().removeClass("rowTemplate");
		$row.find(".zone").text(mamulZone[mamul.name]);
		$row.find(".name").text(mamul.name);
		$table.append($row);
	}
	
}